cdhooper/amigapci_stm32/pcmds.c
rc_t
cmd_time(int argc, char * const *argv)
{
    rc_t rc;

    if (argc <= 1)
        return (RC_USER_HELP);

    if (strncmp(argv[1], "cmd", 1) == 0) {
        uint64_t time_start;
        uint64_t time_diff;

        if (argc <= 2) {
            printf("error: time cmd requires command to execute\n");
            return (RC_USER_HELP);
        }
        time_start = timer_tick_get();
        rc = cmd_exec_argv(argc - 2, argv + 2);
        time_diff = timer_tick_get() - time_start;
        printf("%llu us\n", timer_tick_to_usec(time_diff));
        if (rc == RC_USER_HELP)
            rc = RC_FAILURE;
    } else if (strncmp(argv[1], "now", 1) == 0) {
        uint64_t now = timer_tick_get();
        printf("tick=0x%llx uptime=%llu usec\n", now, timer_tick_to_usec(now));
        rc = RC_SUCCESS;
    } else if (strncmp(argv[1], "watch", 1) == 0) {
        rc = timer_watch();
    } else if (strncmp(argv[1], "test", 1) == 0) {
        rc = timer_test();
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (rc);
}

rc_t
cmd_map(int argc, char * const *argv)
{
    uint third = (ARRAY_SIZE(memmap) + 2) / 3;
    uint ent;
    for (ent = 0; ent < third; ent++) {
        printf("    %-6s %08x", memmap[ent].name, memmap[ent].addr);
        if (ent + third < ARRAY_SIZE(memmap))
            printf("    %-6s %08x",
                   memmap[ent + third].name, memmap[ent + third].addr);
        if (ent + third * 2 < ARRAY_SIZE(memmap))
            printf("    %-6s %08x",
                   memmap[ent + third * 2].name, memmap[ent + third * 2].addr);
        printf("\n");
    }
    return (RC_SUCCESS);
}

static void
shutdown_all(void)
{
    uart_flush();
    usb_shutdown();
    timer_delay_msec(30);
//  adc_shutdown();
    timer_shutdown();
    /* Put all peripherals in reset */
    /* Clear NVIC? */
}

rc_t
cmd_reset(int argc, char * const *argv)
{
    if (argc < 2) {
        printf("Resetting...\n");
        shutdown_all();
        reset_cpu();
        return (RC_FAILURE);
    } else if (strcmp(argv[1], "amiga") == 0) {
        uint hold = 0;
        uint longreset = 0;
        while (argc > 2) {
            if (strcmp(argv[2], "hold") == 0)
                hold = 1;
            else if (strcmp(argv[2], "long") == 0)
                longreset = 1;
            else
                printf("Invalid reset amiga \"%s\"\n", argv[2]);
            argc--;
            argv++;
        }
        (void) longreset;
//      kbrst_amiga(hold, longreset);
        if (hold)
            printf("Holding Amiga in reset\n");
        else
            printf("Resetting Amiga\n");
    } else if (strncmp(argv[1], "dfu", 3) == 0) {
        uint isrom = (argv[1][3] == 'r');
        printf("Resetting to DFU%s...\n", isrom ? " in ROM" : "");
        shutdown_all();
        reset_dfu(isrom);
    } else if (strcmp(argv[1], "reason") == 0) {
        show_reset_reason();
    } else if (strcmp(argv[1], "usb") == 0) {
        timer_delay_msec(1);
        usb_shutdown();
//      usb_signal_reset_to_host(1);
        usb_init();
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_amiga(int argc, char * const *argv)
{
    if (argc < 2)
        return (RC_USER_HELP);
    if (strncmp(argv[1], "keyboard", 1) == 0) {
        keyboard_term();
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_cpu(int argc, char * const *argv)
{
    if (argc < 2)
        return (RC_USER_HELP);
    if (strncmp(argv[1], "regs", 1) == 0) {
        fault_show_regs(NULL);
    } else if (strncmp(argv[1], "hardfault", 2) == 0) {
        fault_hard();
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_fan(int argc, char * const *argv)
{
    int narg = 0;
    uint fan_speed = -1;
    if (argc < 2)
        return (RC_USER_HELP);
    if (strcmp(argv[1], "auto") == 0) {
        fan_speed = BIT(7) | 100;
    } else if (strcmp(argv[1], "off") == 0) {
        fan_speed = 0;
        narg = 2;
    } else if (strcmp(argv[1], "on") == 0) {
        fan_speed = 100;
        narg = 2;
    } else if (strcmp(argv[1], "speed") == 0) {
        int pos = 0;
        int speed;
        if (argc < 3) {
            printf("fan percent value required (0 - 100)\n");
            return (RC_USER_HELP);
        }
        if ((sscanf(argv[2], "%d%n", &speed, &pos) != 1) ||
            (argv[2][pos] != '\0') || (speed < 0) || (speed > 100)) {
            printf("Invalid fan percent value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        fan_speed = speed;
        narg = 3;
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    fan_set(fan_speed);
    if (narg < argc) {
        if (strcasecmp(argv[narg], "save") == 0) {
            config.fan_speed = fan_speed;
            config_updated();
        }
    }

    return (RC_SUCCESS);
}

rc_t
cmd_power(int argc, char * const *argv)
{
    const char *cmd;
    cmd = skip(argv[0], "power");
    if (*cmd == '\0') {
        if (argc < 2)
            return (RC_USER_HELP);
        argc--;
        argv++;
        cmd = argv[0];
    }
    if (strcmp(cmd, "cycle") == 0) {
        power_set(POWER_STATE_CYCLE);
    } else if (strcmp(cmd, "on") == 0) {
        power_set(POWER_STATE_ON);
    } else if (strcmp(cmd, "off") == 0) {
        power_set(POWER_STATE_OFF);
    } else if (strncmp(cmd, "show", 1) == 0) {
        power_show();
        sensor_show();
    } else {
        printf("Unknown argument %s\n", cmd);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

rc_t
cmd_usb(int argc, char * const *argv)
{
    if (argc < 2)
        return (RC_USER_HELP);
    if (strncmp(argv[1], "debug", 2) == 0) {
        uint debug_mask;
        int  pos = 0;
        if (argc < 3) {
            printf("usb %s requires an argument\n", argv[1]);
            return (RC_USER_HELP);
        }
        if ((sscanf(argv[2], "%x%n", &debug_mask, &pos) != 1) ||
            (argv[2][pos] != '\0')) {
            printf("Invalid argument to debug: %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        usb_debug_mask = debug_mask;
    } else if (strncmp(argv[1], "disable", 3) == 0) {
        timer_delay_msec(1);
        usb_shutdown();
//      usb_signal_reset_to_host(0);
        return (RC_SUCCESS);
    } else if ((strcmp(argv[1], "kbd") == 0) ||
               (strncmp(argv[1], "keyboard", 2) == 0)) {
        if (argc < 3) {
            printf("USB keyboard input: %s\n",
                   usb_keyboard_terminal ? "on" : "off");
        } else if (strcmp(argv[2], "on") == 0) {
            usb_keyboard_terminal = 1;
        } else if (strcmp(argv[2], "off") == 0) {
            usb_keyboard_terminal = 0;
        } else {
            printf("Invalid argument %s\n", argv[2]);
            return (RC_BAD_PARAM);
        }
    } else if (strcmp(argv[1], "ls") == 0) {
        usb_ls(0);
    } else if (strcmp(argv[1], "off") == 0) {
        usb_set_power(0);
    } else if (strcmp(argv[1], "on") == 0) {
        usb_set_power(1);
    } else if (strncmp(argv[1], "regs", 3) == 0) {
        usb_show_regs();
    } else if (strcmp(argv[1], "reset") == 0) {
        timer_delay_msec(1);
        usb_shutdown();
//      usb_signal_reset_to_host(1);
        usb_init();
        return (RC_SUCCESS);
    } else if (strncmp(argv[1], "stat", 2) == 0) {
        usb_show_stats();
    } else {
        printf("Unknown argument %s\n", argv[1]);
        return (RC_USER_HELP);
    }
    return (RC_SUCCESS);
}

