cdhooper/amigapci_stm32/pcmds.c
rc_t
cmd_gpio(int argc, char * const *argv)
{
    int arg;
    if (argc < 2) {
        gpio_show(-1, 0xffff);
        return (RC_SUCCESS);
    }

    for (arg = 1; arg < argc; arg++) {
        const char *ptr = argv[arg];
        int port = -1;
        uint16_t pins[NUM_GPIO_BANKS];
        const char *assign = NULL;

        memset(pins, 0, sizeof (pins));

        if (gpio_name_match(&ptr, pins) != 0) {
            if ((*ptr == 'p') || (*ptr == 'P'))
                ptr++;

            /* Find port, if specified */
            if ((*ptr >= 'a') && (*ptr <= 'f'))
                port = *(ptr++) - 'a';
            else if ((*ptr >= 'A') && (*ptr <= 'F'))
                port = *(ptr++) - 'A';

            /* Find pin, if specified */
            if ((*ptr >= '0') && (*ptr <= '9')) {
                uint pin = *(ptr++) - '0';
                if ((*ptr >= '0') && (*ptr <= '9'))
                    pin = pin * 10 + *(ptr++) - '0';
                if (pin > 15) {
                    printf("Invalid argument %s\n", argv[arg]);
                    return (RC_BAD_PARAM);
                }
                pins[port] = BIT(pin);
            } else if (*ptr == '*') {
                ptr++;
                pins[port] = 0xffff;
            }
        }

        if (*ptr == '=') {
            assign = ptr + 1;
            ptr = "";
            if (port == -1) {
                uint tport;
                for (tport = 0; tport < NUM_GPIO_BANKS; tport++)
                    if (pins[tport] != 0)
                        break;
                if (tport == NUM_GPIO_BANKS) {
                    printf("You must specify the GPIO to assign: %s\n",
                           argv[arg]);
                    return (RC_BAD_PARAM);
                }
            }
        }
        if (*ptr != '\0') {
            printf("Invalid argument %s\n", argv[arg]);
            return (RC_BAD_PARAM);
        }

        if (assign != NULL) {
            if (port == -1) {
                for (port = 0; port < NUM_GPIO_BANKS; port++) {
                    if (pins[port] != 0) {
                        gpio_assign(port, pins[port], assign);
                    }
                }
            } else {
                gpio_assign(port, pins[port], assign);
            }
        } else {
            if (port == -1) {
                for (port = 0; port < NUM_GPIO_BANKS; port++)
                    gpio_show(port, pins[port]);
            } else {
                gpio_show(port, pins[port]);
            }
        }
    }

    return (RC_SUCCESS);
}

static const char *const debug_bits[] = {
    "Keyboard", "Mouse", "", "",
        "", "", "", "",
    "", "", "", "",
        "", "", "", "",
    "", "", "", "",
        "", "", "", "",
    "", "", "", "",
        "", "", "", "",
};
static void
decode_debug_flags(uint32_t flags)
{
    uint bit;
    uint printed = 0;

    for (bit = 0; bit < 32; bit++) {
        if (flags & BIT(bit)) {
            if (printed++)
                printf(", ");
            if (debug_bits[bit][0] == '\0') {
                printf("bit%u", bit);
            } else {
                printf("%s", debug_bits[bit]);
            }
        }
    }
}

static uint
match_debug_flag(const char *name)
{
    uint bit;
    for (bit = 0; bit < 32; bit++) {
        if (strcasecmp(name, debug_bits[bit]) == 0)
            return (bit);
    }
    return (bit);
}

#define CFOFF(x) offsetof(config_t, x), sizeof (config.x)

#define MODE_DEC         0       // Show value in decimal
#define MODE_HEX         BIT(0)  // Show value in hexadecimal
#define MODE_STRING      BIT(1)  // Show string
#define MODE_DEBUG_FLAGS BIT(2)  // Decode debug flags
#define MODE_FAN_AUTO    BIT(3)  // Interpret BIT(7) as "auto" otherwise decimal
#define MODE_SIGNED      BIT(4)  // Decimal value is signed
typedef struct {
    const char *cs_name;
    const char *cs_desc;
    uint16_t    cs_offset;  // Offset into config structure
    uint8_t     cs_size;    // Size of config value in bytes
    uint8_t     cs_mode;    // Mode bits for display (1=hex)
} config_set_t;
static const config_set_t config_set[] = {
    { "cpu_temp_bias",  "Bias (+/-) for CPU temperature",
      CFOFF(cpu_temp_bias), MODE_SIGNED },
    { "debug",         "",
      CFOFF(debug_flag), MODE_HEX | MODE_DEBUG_FLAGS },
    { "fan_rpm_max",  "Fan maximum speed in RPM",
      CFOFF(fan_rpm_max), MODE_DEC },
    { "fan_speed",     "Fan speed",
      CFOFF(fan_speed), MODE_FAN_AUTO },
    { "fan_speed_min", "Fan speed minimum percent",
      CFOFF(fan_speed_min), MODE_DEC },
    { "fan_temp_max",  "CPU temp for max fan speed",
      CFOFF(fan_temp_max), MODE_DEC },
    { "fan_temp_min",  "CPU temp for min fan speed",
      CFOFF(fan_temp_min), MODE_DEC },
    { "name",          "Board name",
      CFOFF(name), MODE_STRING },
    { "pson",          "Power on at AC restored",
      CFOFF(ps_on_mode), MODE_DEC },
};

rc_t
cmd_set(int argc, char * const *argv)
{
    if (argc <= 1) {
        uint pos;
        for (pos = 0; pos < ARRAY_SIZE(config_set); pos++) {
            char buf[32];
            const config_set_t *c = &config_set[pos];
            uint cs_mode = c->cs_mode;
            uint value = 0;
            void *src = (void *) ((uintptr_t) &config + c->cs_offset);
            if (cs_mode & MODE_STRING) {
                /* String */
                sprintf(buf, "%s \"%.*s\"",
                        c->cs_name, c->cs_size, (char *)src);
            } else if (cs_mode & MODE_HEX) {
                /* Hexadecimal */
                memcpy(&value, src, c->cs_size);
                sprintf(buf, "%s %0*x", c->cs_name, c->cs_size * 2, value);
            } else {
                /* Decimal : MODE_DEC */
                memcpy(&value, src, c->cs_size);
                if ((cs_mode & MODE_FAN_AUTO) && (value & BIT(7))) {
                    sprintf(buf, "%s %s", c->cs_name, "auto");
                } else if (cs_mode & MODE_SIGNED) {
                    if (c->cs_size == 1)
                        value = (int8_t) value;
                    else if (c->cs_size == 2)
                        value = (int16_t) value;
                    sprintf(buf, "%s %d", c->cs_name, value);
                } else {
                    sprintf(buf, "%s %u", c->cs_name, value);
                }
            }
            printf("%s%*s%s", buf, 24 - strlen(buf), "", c->cs_desc);
            if (cs_mode & MODE_DEBUG_FLAGS) {
                /* Also decode flags (currently only debug flags) */
                if (value == 0)
                    printf("Debug flags");
                decode_debug_flags(value);
            }
            printf("\n");
        }
        return (RC_SUCCESS);
    }
    if ((strcmp(argv[1], "help") == 0) ||
               (strcmp(argv[1], "?") == 0)) {
        return (RC_USER_HELP);
    } else if (strcmp(argv[1], "cpu_temp_bias") == 0) {
        int pos = 0;
        int bias;
        if (argc != 3) {
            printf("CPU temp bias value required (-100 - 100)\n");
            return (RC_BAD_PARAM);
        }
        if ((sscanf(argv[2], "%d%n", &bias, &pos) != 1) ||
                   (argv[2][pos] != '\0') || (bias < -100) || (bias > 100)) {
            printf("Invalid CPU tempo bias value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        config.cpu_temp_bias = bias;
        config_updated();
    } else if (strcmp(argv[1], "debug") == 0) {
        int      arg;
        int      pos = 0;
        uint     bit;
        uint     do_save = 0;
        uint     did_set = 0;
        uint32_t value;
        uint32_t nvalue = config.debug_flag;
        if (argc <= 2) {
            printf("Debug flags are a combination of bits\n");
            for (bit = 0; bit < 32; bit++)
                if (debug_bits[bit][0] != '\0')
                    printf("  %2u  %s\n", bit, debug_bits[bit]);
            printf("Current debug %08lx  ", config.debug_flag);
            decode_debug_flags(config.debug_flag);
            printf("\n");
            return (RC_SUCCESS);
        }
        for (arg = 2; arg < argc; arg++) {
            if (strcasecmp(argv[arg], "save") == 0) {
                do_save = 1;
                continue;
            } else if ((bit = match_debug_flag(argv[arg])) < 32) {
                if (did_set == 0)
                    nvalue = 0;
                nvalue |= BIT(bit);
                did_set = 1;
            } else {
                if ((sscanf(argv[arg], "%x%n", &value, &pos) != 1) ||
                    (argv[arg][pos] != '\0')) {
                    printf("Invalid argument: %s\n", argv[arg]);
                    return (RC_USER_HELP);
                }
                nvalue = value;
                did_set = 1;
            }
        }
        if (config.debug_flag != nvalue) {
            config.debug_flag = nvalue;
            printf("debug %08lx", nvalue);
            decode_debug_flags(nvalue);
            printf("\n");
        }
        if (do_save)
            config_updated();
    } else if (strcmp(argv[1], "defaults") == 0) {
        if ((argc == 3) && (strncmp(argv[2], "keyboard", 1) == 0)) {
            keyboard_set_defaults();
            config_updated();
        } else {
            config_set_defaults();
        }
    } else if (strcmp(argv[1], "fan_rpm_max") == 0) {
        int pos = 0;
        int rpm;
        if (argc != 3) {
            printf("fan RPM value required (0 - 32000)\n");
            return (RC_BAD_PARAM);
        }
        if ((sscanf(argv[2], "%d%n", &rpm, &pos) != 1) ||
                   (argv[2][pos] != '\0') || (rpm < 0) || (rpm > 32000)) {
            printf("Invalid fan RPM value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        config.fan_rpm_max = rpm;
        config_updated();
    } else if (strcmp(argv[1], "fan_speed") == 0) {
        int pos = 0;
        int speed;
        if (argc != 3) {
            printf("fan percent value required (0 - 100) or auto\n");
            return (RC_BAD_PARAM);
        }
        if (strcmp(argv[2], "auto") == 0) {
            speed = BIT(7) | 100;
        } else if ((sscanf(argv[2], "%d%n", &speed, &pos) != 1) ||
                   (argv[2][pos] != '\0') || (speed < 0) || (speed > 100)) {
            printf("Invalid fan percent value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        fan_set(speed);
        config.fan_speed = speed;
        config_updated();
    } else if (strcmp(argv[1], "fan_speed_min") == 0) {
        int pos = 0;
        int speed;
        if (argc != 3) {
            printf("fan percent value required (0 - 100)\n");
            return (RC_BAD_PARAM);
        }
        if ((sscanf(argv[2], "%d%n", &speed, &pos) != 1) ||
            (argv[2][pos] != '\0') || (speed < 0) || (speed > 100)) {
            printf("Invalid fan percent value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        config.fan_speed_min = speed;
        config_updated();
    } else if ((strcmp(argv[1], "fan_temp_min") == 0) ||
               (strcmp(argv[1], "fan_temp_max") == 0)) {
        int pos = 0;
        int value;
        if (argc != 3) {
            printf("Integer temperature percent required (0 - 127)\n");
            return (RC_BAD_PARAM);
        }
        if ((sscanf(argv[2], "%d%n", &value, &pos) != 1) ||
            (argv[2][pos] != '\0') || (value < 0) || (value > 127)) {
            printf("Invalid temperature value %s\n", argv[2]);
            return (RC_USER_HELP);
        }
        if (strcmp(argv[1], "fan_temp_min") == 0)
            config.fan_temp_min = value;
        else
            config.fan_temp_max = value;
        config_updated();
    } else if (strcmp(argv[1], "name") == 0) {
        config_name((argc < 2) ? NULL : argv[2]);
        return (RC_SUCCESS);
    } else if (strcmp(argv[1], "pson") == 0) {
        if (argc <= 2)
            return (RC_USER_HELP);
        if (strcmp(argv[2], "on") == 0) {
            config.ps_on_mode |= 1;
        } else if (strcmp(argv[2], "off") == 0) {
            config.ps_on_mode &= 1;
        } else {
            uint mode;
            int  pos = 0;
            if ((sscanf(argv[2], "%x%n", &mode, &pos) != 1) ||
                (argv[2][pos] != '\0') || (mode > 0xff)) {
                printf("Invalid argument: %s\n", argv[2]);
                return (RC_USER_HELP);
            }
            config.ps_on_mode = mode;
            config_updated();
        }
    } else {
        printf("set \"%s\" unknown argument\n", argv[1]);
        return (RC_USER_HELP);
    }

    return (RC_SUCCESS);
}


rc_t
cmd_snoop(int argc, char * const *argv)
{
    printf("Snoop not implemented\n");
    return (RC_USER_HELP);
#if 0
    uint mode = CAPTURE_SW;
    if (argc > 1) {
        if (strcmp(argv[1], "addr") == 0) {
            mode = CAPTURE_ADDR;
        } else if (strncmp(argv[1], "low", 2) == 0) {
            mode = CAPTURE_DATA_LO;
        } else if (strncmp(argv[1], "high", 2) == 0) {
            mode = CAPTURE_DATA_HI;
        } else {
            printf("snoop \"%s\" unknown argument\n", argv[1]);
            return (RC_USER_HELP);
        }
    }
    bus_snoop(mode);

    return (RC_SUCCESS);
#endif
}
